Revit 2016 API
LoadCombination Properties
The LoadCombination type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CombinationCaseName |  Obsolete.
Returns load combination case name.
CombinationNatureName |  Obsolete.
Returns load combination nature name of load case element.
CombinationState |  Obsolete.
Returns load combination state.
CombinationStateIndex |  Obsolete.
Returns the index in predefined load combination state array {}.
CombinationType |  Obsolete.
Returns load combination type.
CombinationTypeIndex |  Obsolete.
Returns the index in predefined load combination type array.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Factor |  Obsolete.
Returns factor value.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsThirdPartyGenerated
 Indicates if the load combination was created by API.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
NumberOfComponents |  Obsolete.
Returns number of factors.
NumberOfUsages |  Obsolete.
Returns number of usages.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
State
 The state of the load combination.
Type
 The type of the load combination.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UsageName |  Obsolete.
Returns usage value.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace